app/controllers/results_controller.rb

  def new
		@result = Result.new
		@work=Work.find(params[:work_id])
---
SELECT * FROM "works" WHERE ("works"."id" = '--- :work_id

  def create
		@work=Work.find(params[:work_id])
		@result=@work.results.build(params[:result])

		if @result.save
---
SELECT * FROM "works" WHERE ("works"."id" = 1)
INSERT INTO "results" ("q1", "final", "q2", "updated_at", "q3", "q4", "q5", "q6", "q7", "count", "work_id", "created_at") VALUES(10, -20, -10, '2009-08-04 23:53:53', -10, -5, 5, -10, -10, 0, 24, '2009-08-04 23:53:53')