app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def index
    @users=User.find(:all)

INSERT INTO "users" ("updated_at", "crypted_password", "username", "password_salt", "persistence_token", "email", "created_at") VALUES('2009-08-01 05:27:45', 'd0bc167fbadc7bdb525926eeaec75a6cccad607354f51ff2251bf84824d8bbfe2be99320c6eac3b2c25e8762abf1a7fabf09adbfd80dcf1a05f32cabad111fbd', 'maxwell', 'RbuTg6_WQ5CdcQZvIdAA', '7d62d42d9bdffad8c9d0a97c00986d8575c0b9139946aeb192ae28efc17c726f2c159d42e4295e9f938da8b56761cf4dec21a59ba93afa08993c495e036b491f', 'mbs348@gmail.com', '2009-08-01 05:27:45')
---
  def create
    @user = User.new(params[:user])
    if @user.save