app/controllers/works_controller.rb

	def index
		@works = Work.paginate 	:page  => params[:page],
														:order  => 'created_at DESC',
														:per_page  => 6
---
SELECT * FROM "works" ORDER BY results_count DESC LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM "works"

  def create
			@work = Work.new(params[:work])
			if @work.save
---
INSERT INTO "works" ("name", "updated_at", "submitter", "url", "results_count", "embed_url", "created_at", "thumb_url") VALUES('big box and maru', '2009-08-02 20:14:00', 'Max', 'http://www.youtube.com/watch?v=xdhLQCYQ-nQ', 0, NULL, '2009-08-02 20:14:00', NULL)

  def show
			@work = Work.find(params[:id])
			@results = @work.results.all.paginate :page  => params[:page],
  														              :order  => 'created_at DESC',
  														              :per_page  => 6
---
SELECT * FROM "works" WHERE ("works"."id" = 1) LIMIT 1
SELECT * FROM "results" WHERE ("results".work_id = 1) ORDER BY id DESC
SELECT count(*) AS count_all FROM "results" WHERE ("results".work_id = 1)